# AncestorIdx Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementPath..::..AncestorIdx Property
DisplacementPath Class See Also
---
Specifies the end point of the path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int AncestorIdx { get; set; }
```

Visual Basic
---
```text
Public Property AncestorIdx As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int AncestorIdx {
	int get ();
	void set (int value);
}
```

# See Also
DisplacementPath Class
Autodesk.Revit.DB Namespace